RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_usart.c
/*******************************************************************************
* Function Name  : USART_GetITStatus
* Description    : Checks whether the specified USART interrupt has occurred or not.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_IT: specifies the USART interrupt source to check.
*                    USART_IT_CTS: CTS change interrupt.
*                    USART_IT_LBD: LIN Break detection interrupt.
*                    USART_IT_TXE: Tansmit Data Register empty interrupt.
*                    USART_IT_TC: Transmission complete interrupt.
*                    USART_IT_RXNE: Receive Data register not empty interrupt.
*                    USART_IT_IDLE: Idle line detection interrupt.
*                    USART_IT_ORE_RX : OverRun Error interrupt if the RXNEIE bit is set.
*                    USART_IT_ORE_ER : OverRun Error interrupt if the EIE bit is set.
*                    USART_IT_NE: Noise Error interrupt.
*                    USART_IT_FE: Framing Error interrupt.
*                    USART_IT_PE: Parity Error interrupt.
* Return         : bitstatus: SET or RESET.
*******************************************************************************/
ITStatus USART_GetITStatus(USART_TypeDef* USARTx, uint16_t USART_IT)
{
  uint32_t bitpos = 0x00, itmask = 0x00, usartreg = 0x00;
  ITStatus bitstatus = RESET;

  if (USART_IT == USART_IT_CTS)
  {
  }   
  
  usartreg = (((uint8_t)USART_IT) >> 0x05);
  itmask = USART_IT & IT_Mask;
  itmask = (uint32_t)0x01 << itmask;
  
  if (usartreg == 0x01) 
  {
    itmask &= USARTx->CTLR1;
  }
  else if (usartreg == 0x02) 
  {
    itmask &= USARTx->CTLR2;
  }
  else 
  {
    itmask &= USARTx->CTLR3;
  }
  
  bitpos = USART_IT >> 0x08;
  bitpos = (uint32_t)0x01 << bitpos;
  bitpos &= USARTx->STATR;
	
  if ((itmask != (uint16_t)RESET)&&(bitpos != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  
  return bitstatus;  
}

/*******************************************************************************
* Function Name  : USART_ClearITPendingBit
* Description    : Clears the USARTx's interrupt pending bits.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_IT: specifies the interrupt pending bit to clear.
*                    USART_IT_CTS:  CTS change interrupt. 
*                    USART_IT_LBD:  LIN Break detection interrupt.
*                    USART_IT_TC:   Transmission complete interrupt.
*                    USART_IT_RXNE: Receive Data register not empty interrupt.
* Return         : None
*******************************************************************************/
void USART_ClearITPendingBit(USART_TypeDef* USARTx, uint16_t USART_IT)
{
  uint16_t bitpos = 0x00, itmask = 0x00;

  if (USART_IT == USART_IT_CTS)
  {
  }   
  
  bitpos = USART_IT >> 0x08;
  itmask = ((uint16_t)0x01 << (uint16_t)bitpos);
  USARTx->STATR = (uint16_t)~itmask;
}








